<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1252">
<title>principio de incertidumbre</title>

<link href="../gb.css" rel="stylesheet" type="text/css" />
</head>

<body dir="ltr">
<table width="800" border="0" align="center" cellspacing="0">
  <tr>
    <td width="460" align="center" bgcolor="#FFFFFF" class="Estilo1"><script type="text/javascript">
// BeginWebWidget phatfusion_slideShow: pf_slideShow1

 	window.addEvent('domready',function(){
    var obj_pf_slideShow1 = { 
                wait: 5000, 
					      effect: 'fade',
					      duration: 1000, 
                direction: 'fade',
					      loop: true, 
					      thumbnails: true,
					      backgroundSlider: true,
					      onClick: function(i){alert(i)}
				      }
    show = new SlideShow('pf_slideShow1','slideshowContainerCopy3','slideshowThumbnail',obj_pf_slideShow1);
	  show.play();
	});


// EndWebWidget phatfusion_slideShow: pf_slideShow1
      </script></td>
  </tr>
  <tr>
    <td align="center" bgcolor="#FFFFFF" class="Estilo1">&nbsp;</td>
  </tr>
  <tr>
    <td bgcolor="#FFFFFF" class="Estilo1"><table width="800" border="0" align="center" cellpadding="0" cellspacing="0">
      <tr>
        <td><span class="title">Principio de incertidumbre</span></td>
      </tr>
      <tr>
        <td width="135" align="center" valign="middle"><p align="left" class="title">
          <iframe width="640" height="360" src="//www.youtube.com/embed/FX1-uI9a7_U?feature=player_detailpage" frameborder="0" allowfullscreen></iframe>
          &nbsp;</p></td>
        </tr>
      <tr>
        <td><p align="left" class="title">Justificaci&oacute;n del proyecto
          <!-- 		@page { margin: 2cm } 		P { margin-bottom: 0.21cm } 	-->
        </p>
          </p>sss
          <p>La m&uacute;sica aleatoria es un t&eacute;rmino que aparece en los a&ntilde;os 50 en textos de Werner Meyer-Eppler, aunque ya se conoc&iacute;an precedentes.</p>
          <p>A finales del siglo XVIII ya exist&iacute;a el Musikalisches W&uuml;rfelspiel (Juego de dados musical).</p>
          <p>Se trataba de componer m&uacute;sica con dados, y fue Mozart el que lo populariz&oacute; y a qui&eacute;n se le atribuye el juego, aunque nunca se pudo demostrar. El dado seleccionaba al azar breves pasajes de m&uacute;sica, que ser&iacute;an puestos uno a continuaci&oacute;n del otro para crear una pieza sin necesidad de tener conocimientos musicales. </p>
          <p>Con la aparici&oacute;n de la m&uacute;sica electr&oacute;nica a finales del siglo XIX las probabilidades se expanden y empiezan a aparecer m&aacute;quinas que facilitan la experimentaci&oacute;n.</p>
          <p>En 1970 Don Buchla desarroll&oacute; la caja de m&uacute;sica el&eacute;ctrica serie 200. Se trataba de un sintetizador modular controlado por voltaje. Entre esos casi cincuenta m&oacute;dulos se encontraba el 265 y el 266: el <strong>&ldquo;</strong><strong>Source of Uncertainty&rdquo;</strong></p>
          <p>Se trata de un generador de voltaje aleatorio y fue uno de los primeros instrumentos electr&oacute;nicos orientados a generar m&uacute;sica aleatoria. Buchla se opuso a la idea de Robert Moog de a&ntilde;adir un teclado convencional para controlar los sintetizadores.</p>
          <p>&ldquo;<strong>Principio de incertidumbre&rdquo; </strong>presenta una composici&oacute;n generada por m&aacute;quinas dise&ntilde;adas para interpretar m&uacute;sica aleatoria a partir de la interacci&oacute;n de los espectadores.</p>
          <p>Es un instrumento int&eacute;rprete con unos par&aacute;metros establecidos para generar m&uacute;sica a tiempo real dentro de una composici&oacute;n modificable.</p>
          <p>No se trata de una composici&oacute;n aleatoria en su totalidad, hay par&aacute;metros concretos para que existan armon&iacute;as y melod&iacute;as. Al igual que Mozart con su juego de dados musical, se trata de utilizar la aleatoriedad para definir la forma final de la composici&oacute;n pero con la certeza de que suene m&uacute;sica arm&oacute;nica.</p>
          <p>El espectador, ser&iacute;a el principal factor de aleatoriedad en la composici&oacute;n final. </p>
          <p>&nbsp;</p>
          <p class="title">Descripci&oacute;n del proyecto
            <!-- 		@page { margin: 2cm } 		P { margin-bottom: 0.21cm } 	-->
            <BODY DIR="LTR">
          </p>
          <p>La exposici&oacute;n estar&aacute; formada por una m&aacute;quina (En la que interviene el espectador-compositor) y una serie de partituras-esculturas derivadas de estas composiciones (Composiciones geom&eacute;tricas tridimensionales).</p>
          <p><strong>A. LA M&Aacute;QUINA</strong></p>
          <p>Genera e interpreta la composici&oacute;n y se estructura en tres partes:</p>
          <p><strong>1. Generador arm&oacute;nico</strong></p>
          <p> <em><a href="/imatges/principio_de_incertidumbre/grafico_01.jpg" target="_blank">(Imagen 1-Gr&aacute;fico de los par&aacute;metros escogidos)</a></em></p>
          <p> Es el encargado de generar las notas aleatorias relativas a unos par&aacute;metros determinados.</p>
          <p><br />
          </p>
          <ol>
            <ol>
              <p><strong>1.1 		Par&aacute;metros</strong></p>
              <p>1_Doce notas.</p>
              <p>2_Doce modos.</p>
              <p>3_Doce tipos de compases.</p>
              <p>4_Cantidad de notas*</p>
              <p>5_Desplazamiento*</p>
              <p>6_Nivel</p>
              <p>7_La rueda arm&oacute;nica puede variar de 1 a 16 compases, activando o desactivando el interruptor de cada uno.</p>
              <p>Con estos siete par&aacute;metros tendremos una rueda arm&oacute;nica entera. Cada acorde con un tono armon&iacute;a y comp&aacute;s distinto. </p>
              <p>**<em>En los par&aacute;metros cuatro y cinco se utilizan algoritmos euclidianos para el numero y posici&oacute;n de las notas. Es un algoritmo basado en los elementos de Euclides para distribuir una cantidad de notas de la manera m&aacute;s uniforme posible a lo largo de un per&iacute;odo de tiempo. <a href="http://www.hisschemoller.com/2011/euclidean-rhythms/" target="_blank">http://www.hisschemoller.com/2011/euclidean-rhythms/</a></em></p>
              <p><strong>1.2 Panel del generador arm&oacute;nico</strong></p>
              <p><em><a href="/imatges/principio_de_incertidumbre/panel_generador_armonico.jpg" target="_blank">(Imagen 3)</a></em></p>
              <p>Los siete par&aacute;metros citados anteriormente se encuentran en la misma columna y se controlan mediante potenci&oacute;metros. Cada columna representa un acorde y en total hay doce. </p>
              <p>&Eacute;sto facilita la creaci&oacute;n de ruedas arm&oacute;nicas complejas.</p>
              <p><strong>2-El generador de sonido</strong></p>
              <p><em><a href="/imatges/principio_de_incertidumbre/panel_generador-de-sonido.jpg" target="_blank">(Imagen 4 - Panel)</a> <a href="/imatges/principio_de_incertidumbre/pcbs_serge.jpg" target="_blank">(Imagen 5 - Pcbs)</a></em></p>
              <p>Para reproducir las notas se construir&aacute; un sintetizador de tres voces, basado en el proyecto de Serge Tcherepnin, que inici&oacute; en 1973 en la &ldquo;School of Music-California Institute of the Arts&rdquo; en Valencia, California. Es cuando naci&oacute; el &ldquo;People&rsquo;s Synthesizer&rdquo; o lo que m&aacute;s tarde se conoci&oacute; como el &ldquo;Serge modular&rdquo;. Es uno de los primeros proyectos DIY en sintetizadores. Se trataba de que alumnos pudieran dise&ntilde;ar sus propios instrumentos electr&oacute;nicos sin tener que desembolsar una cantidad de dinero muy grande, ya que los proyectos que funcionaban en ese momento, como Buchla, Moog o EMS ten&iacute;an precios prohibitivos.</p>
              <p>Para el generador de sonido de <strong>&ldquo;Principio de incertidumbre&rdquo; </strong>utilizo las placas electr&oacute;nicas de Ken Stone, la persona que constru&iacute;a las placas electr&oacute;nicas para Serge. A d&iacute;a de hoy las sigue distribuyendo. Es un proyecto vivo cuarenta a&ntilde;os despu&eacute;s. </p>
              <p><strong>3-La matriz </strong></p>
              <p><em><a href="/imatges/principio_de_incertidumbre/matriz.jpg" target="_blank">(Imagen 6 - Panel)</a></em></p>
              <p>La construcci&oacute;n del panel requiere algunos cambios respecto a los paneles originales, ya que para que los espectadores lo puedan intervenir sin romper el patch* sustituyo las bananas (Conectores de cables apilables) por una matriz de interruptores al estilo de los EMS Sinthi*. De esa forma se pueden conectar todos los par&aacute;metros entre s&iacute; sin tener que utilizar cables externos.</p>
              <p>*Patch: Se llamaba &ldquo;patch&rdquo; al conjunto de conexiones y a la forma en que se configuraban los par&aacute;metros en un sintetizador modular. </p>
              <p>*EMS Sinyhi: Sintetizador modular port&aacute;til fabricado en Inglaterra desde 1971.</p>
            </ol>
          </ol>
          <p><br />
          </p>
          <p><strong>B. COMPOSICIONES GEOM&Eacute;TRICAS TRIDIMENSIONALES</strong></p>
          <p> <em><a href="/imatges/principio_de_incertidumbre/composiciones_geometricas_tridimensinales.jpg" target="_blank">(imagen 7 - Gr&aacute;fico)</a></em></p>
          <p> <br />
          </p>
          <p> Se trata de generar esculturas tridimensionales construidas a partir de asociar par&aacute;metros arm&oacute;nicos a formas geom&eacute;tricas extruidas. </p>
          <p> Por cada rueda de acordes se genera un objeto, al ser apilables forman una estructura que representa una canci&oacute;n. Estas columnas muestran distintas estructuras musicales. </p>
          <p></p>
          <p align="left" class="titulo">&nbsp;</p>
          <p align="left" class="Estilo1Copy">&nbsp;</p></td>
        </tr>
    </table></td>
  </tr>
  
  <tr>
    <td align="left" valign="middle" bgcolor="#FFFFFF" class="title"><p>Enlaces interesantes para el proyecto:</p>
    <p class="text"><a href="http://tones.wolfram.com/generate/advanced.html?pitch" target="_blank">http://tones.wolfram.com/generate/advanced.html?pitch</a></p>
    <p class="text"><a href="http://musicthing.co.uk/modular/?p=225" target="_blank">http://musicthing.co.uk/modular/?p=225</a></p>
    <p class="text"><a href="http://musicthing.co.uk/modular/?p=255" target="_blank">http://musicthing.co.uk/modular/?p=255</a></p>
    <p class="text"><a href="http://www.muffwiggler.com/forum/viewtopic.php?p=673084#673084" target="_blank">http://www.muffwiggler.com/forum/viewtopic.php?p=673084#673084</a></p>
    <p class="text"><a href="http://www.cgs.synth.net/pcb/bestofcgs.html" target="_blank">http://www.cgs.synth.net/pcb/bestofcgs.html</a>    </p>
    <p class="text">&nbsp;</p></td>
  </tr>
  <tr>
    <td align="center" bgcolor="#FFFFFF"><table width="200" border="0">
      <tr>
        <td>&nbsp;</td>
        <td align="center"><a href="../default.html" >&forall;</a></td>
        <td align="right">&nbsp;</td>
      </tr>
    </table></td>
  </tr>
</table>
<div align="center"></div>
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-499533-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</body>
</html>
